Белгипрозем_2017/src/Enums/НаправленияЭД/НаправленияЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияЭД</name>
  <enumValues>
    <name>Входящий</name>
  </enumValues>
  <enumValues>
    <name>Интеркампани</name>
  </enumValues>
  <enumValues>
    <name>Исходящий</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/ВидыЭД/ВидыЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭД</name>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>АктИсполнитель</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ДопДанные</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>Подтверждение</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйЭД</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиОтправитель</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Продавец</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточнении</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросЗонд</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНаОтзывЭД</name>
  </enumValues>
  <enumValues>
    <name>ШтампБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКвитанция</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеТребование</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПродавца</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Documents/ПакетЭД/ПакетЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПакетЭД</name>
  <posting>Deny</posting>
  <attributes>
    <name>АдресРесурсаКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРесурсаОрганизации</name>
    <type>
      <types>String</types>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФорматаПакета</name>
    <type>
      <types>EnumRef.ВерсииФорматаПакетаЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийУИД</name>
    <comment>Уникальный идентификатор объекта во внешней системе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеЗашифрованы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.КлассификаторБанковРБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СертификатШифрования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеЭД</name>
    <type>
      <types>CatalogRef.СоглашенияОбИспользованииЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбменаЭД</name>
    <type>
      <types>EnumRef.СпособыОбменаЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПакета</name>
    <type>
      <types>EnumRef.СтатусыПакетовЭД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлектронныеДокументы</name>
    <attributes>
      <name>ОбъектВладелец</name>
      <type>
        <types>CatalogRef.ВходящиеДокументы</types>
        <types>CatalogRef.СоглашенияОбИспользованииЭД</types>
        <types>CatalogRef.ИсходящиеДокументы</types>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьДанныеЗашифрованы</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСертификатШифрования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектронныйДокумент</name>
      <type>
        <types>CatalogRef.Файлы</types>
        <types>String</types>
        <types>CatalogRef.СообщенияЭДО</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Catalogs/СертификатыЭП/СертификатыЭП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СертификатыЭП</name>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПоСертификату</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапомнитьПарольКСертификату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеКратко</name>
    <comment>Человекопонятное назначение сертификата, вводимое пользователем</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничитьДоступКСертификату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещенОСрокеДействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отозван</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <comment>Пользователь, кому доступен сертификат подписи</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьСоставИсполнителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаБанка</name>
    <type>
      <types>EnumRef.ПрограммыБанка</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлСертификата</name>
    <comment>Двоичные данные сертификата</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНастроекКриптографии</name>
    <type>
      <types>CatalogRef.ПрофилиНастроекКриптографии</types>
    </type>
  </attributes>
  <attributes>
    <name>КомуВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Усиленный</name>
    <comment>Сертификат является усиленным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыДокументов</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>EnumRef.ВидыЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДляПодписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставИсполнителей</name>
    <comment>Список пользователей, после утверждения или подписания которых, документ переходит на подпись по данному сертификату</comment>
    <attributes>
      <name>Исполнитель</name>
      <comment>Пользователь или группа пользователей</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/СообщенияЭДО/СообщенияЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СообщенияЭДО</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВерсияРегламентаЭДО</name>
    <type>
      <types>EnumRef.ВерсииРегламентаОбмена1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭД</name>
    <type>
      <types>EnumRef.ВидыЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.СоглашенияОбИспользованииЭД</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОтправителя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатусаЭД</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормированияЭДОтправителем</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Пользователь, изменивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
      <types>CatalogRef.КлассификаторБанковРФ</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеЭД</name>
    <type>
      <types>EnumRef.НаправленияЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсииЭД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеЭД</name>
    <type>
      <types>CatalogRef.СоглашенияОбИспользованииЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЭД</name>
    <type>
      <types>EnumRef.СтатусыЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭлементаВерсииЭД</name>
    <type>
      <types>EnumRef.ТипыЭлементовВерсииЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИДВнешний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/CommonForms/ЗапросПароляНаЭПШифрование/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ДобавитьПарольВСертификат(ПарольПользователя)
	
	Если Не ТипЗнч(ВыбранныйСертификат) = Тип("Строка")
		И Не ВыбранныйСертификат.ЗапомнитьПарольКСертификату Тогда
		
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.СертификатыЭП");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыбранныйСертификат);
		Блокировка.Заблокировать();
		
		Сертификат = ВыбранныйСертификат.ПолучитьОбъект();
		Сертификат.ЗапомнитьПарольКСертификату = Истина;
		Сертификат.ПарольПользователя = ПарольПользователя;
		Сертификат.Записать();
		
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьВидимость()
	
	Если ТаблицаЭД.Количество() > 1 Тогда
		Элементы.ОбъектыДляОбработки.Заголовок = НСтр("ru = 'Список'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыбранныйСертификат) Тогда
		Элементы.ВыбранныйСертификат.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыВозвратаПароля()
	
	РезультатВыбора = Новый Структура;
	
	РезультатВыбора.Вставить("ВыбранныйСертификат",         ВыбранныйСертификат);
	РезультатВыбора.Вставить("ЗапомнитьПарольКСертификату", ЗапомнитьПароль);
	РезультатВыбора.Вставить("ПарольПользователя",          ПарольПользователя);
	РезультатВыбора.Вставить("Комментарий",                 "");
	// Определение настроек криптографии
	НастройкиКриптографии = Неопределено;
	Если ТипЗнч(ВыбранныйСертификат) = Тип("СправочникСсылка.СертификатыЭП") Тогда
		ПрофильНастроекКриптографии = РаботаСЭП.ПрофильНастроекКриптографииПоСертификату(ВыбранныйСертификат.Отпечаток);
		НастройкиКриптографии = Новый Структура(
			"ПровайдерЭП,
			|ПутьМодуляКриптографии,
			|ТипПровайдераЭП,
			|АлгоритмПодписи,
			|АлгоритмХеширования,
			|АлгоритмШифрования");
		ЗаполнитьЗначенияСвойств(НастройкиКриптографии, ПрофильНастроекКриптографии);
	КонецЕсли;
	РезультатВыбора.Вставить("НастройкиКриптографии", НастройкиКриптографии);
	// В случае запроса пароля пользователя из помощника создания соглашения ЭД
	// вместо сертификата приходит его представление.
	Если Не ТипЗнч(ВыбранныйСертификат) = Тип("Строка") Тогда
		РезультатВыбора.Вставить("Отпечаток",               ВыбранныйСертификат.Отпечаток);
	КонецЕсли;
	
	Возврат РезультатВыбора;
	
КонецФункции

&НаСервере
Процедура ОбработкаВыбораСертификата()
	
	Элементы.ГруппаЗаполнитьПароль.Доступность = Не ВыбранныйСертификат.ЗапомнитьПарольКСертификату;
	ЗапомнитьПароль = ВыбранныйСертификат.ЗапомнитьПарольКСертификату;
	
	ПарольПользователя = ВыбранныйСертификат.ПарольПользователя;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Выбрать(Команда)
	
	// Блок проверки на заполненность сертификата ЭП.
	Если Не ЗначениеЗаполнено(ВыбранныйСертификат) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ЭлектронныеДокументыКлиентСервер.ПолучитьТекстСообщения("Поле", "Заполнение", "Сертификат подписи"));
		Возврат;
	КонецЕсли;
	
	Если ЗапомнитьПароль Тогда
		ДобавитьПарольВСертификат(ПарольПользователя);
		Оповестить("ЗапросПароляДляСертификата", ВыбранныйСертификат);
	КонецЕсли;
	
	ЭтаФорма.Закрыть(ПараметрыВозвратаПароля());
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ВыбранныйСертификатОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ВыбранныйСертификат);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	ОткрытьФорму("Справочник.СертификатыЭП.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйСертификатПриИзменении(Элемент)
	
	ОбработкаВыбораСертификата();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДляОбработкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТаблицаЭД.Количество() > 1 Тогда
		МассивСтруктур = Новый Массив;
		Для Каждого СтрокаДанных Из ТаблицаЭД Цикл
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("ЭлектронныйДокумент", СтрокаДанных.ЭлектронныйДокумент);
			СтруктураПараметров.Вставить("ВладелецЭД",          СтрокаДанных.ВладелецЭД);
			СтруктураПараметров.Вставить("НаправлениеЭД",       СтрокаДанных.НаправлениеЭД);
			МассивСтруктур.Добавить(СтруктураПараметров);
		КонецЦикла;
		ФормаПросмотраЭД = ОткрытьФорму("Обработка.ЭлектронныеДокументы.Форма.ФормаСпискаВыгружаемыхДокументов",
			Новый Структура("СтруктураЭД", МассивСтруктур), ЭтаФорма);
		
	ИначеЕсли ТипЗнч(ТаблицаЭД[0].ВладелецЭД) = Тип("ДокументСсылка.ПакетЭД") Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ",          ТаблицаЭД[0].ВладелецЭД);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
		ОткрытьФорму("Документ.ПакетЭД.Форма.ФормаДокумента", ПараметрыФормы);
	ИначеЕсли ТипЗнч(ТаблицаЭД[0].ВладелецЭД) = Тип("ДокументСсылка.ПроизвольныйЭД") Тогда
		
		// Откроем вложение по стандартному механизму
		ДанныеФайла = ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьДанныеФайла(ТаблицаЭД[0].ЭлектронныйДокумент,
			УникальныйИдентификатор);
		РаботаСФайламиКлиент.Открыть(ДанныеФайла, Ложь);
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЭлектронныйДокумент", ТаблицаЭД[0].ЭлектронныйДокумент);
		ПараметрыФормы.Вставить("ВладелецЭД",          ТаблицаЭД[0].ВладелецЭД);
		ОткрытьФорму("Обработка.ЭлектронныеДокументы.Форма.ФормаЗагрузкиПросмотраЭД", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПользователяОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	// Обход ошибки платформы 10109820
	ПарольПользователя = Текст;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ВидОперации = Параметры.ВидОперации;
	
	СертификатЭП = "";
	Если Параметры.Свойство("СертификатЭП", СертификатЭП) Тогда
		ВыбранныйСертификат = Параметры.СертификатЭП;
	КонецЕсли;
	
	СертификатыЭП = "";
	Если Параметры.Свойство("СертификатыЭП", СертификатыЭП) Тогда
		Если СертификатыЭП.Количество() > 1 Тогда
			Для каждого Сертификат Из СертификатыЭП Цикл
				Если ТипЗнч(Сертификат) = Тип("СправочникСсылка.СертификатыЭП") Тогда
					Элементы.ВыбранныйСертификат.РежимВыбораИзСписка = Истина;
					Элементы.ВыбранныйСертификат.СписокВыбора.Добавить(Сертификат);
				Иначе
					Элементы.ВыбранныйСертификат.РежимВыбораИзСписка = Истина;
					СсылкаНаСертификат = Справочники.СертификатыЭП.НайтиПоРеквизиту("Отпечаток", Сертификат.Отпечаток);
					Элементы.ВыбранныйСертификат.СписокВыбора.Добавить(СсылкаНаСертификат);
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если ТипЗнч(СертификатыЭП[0]) = Тип("СправочникСсылка.СертификатыЭП") Тогда
				ВыбранныйСертификат = СертификатыЭП[0];
			Иначе
				ВыбранныйСертификат = Справочники.СертификатыЭП.НайтиПоРеквизиту("Отпечаток", СертификатыЭП[0].Отпечаток);
			КонецЕсли;
			ОбработкаВыбораСертификата();
		КонецЕсли;
	КонецЕсли;
	
	ОбъектыДляОбработки = Неопределено;
	Если Параметры.Свойство("ОбъектыДляОбработки", ОбъектыДляОбработки) И ОбъектыДляОбработки <> Неопределено Тогда
		
		Блокировка = Новый БлокировкаДанных;
		НачатьТранзакцию();
		
		Если ТипЗнч(ОбъектыДляОбработки) = Тип("Массив") Тогда
			
			ТаблицаДанныхДляБлокировки = Новый ТаблицаЗначений;
			ТаблицаДанныхДляБлокировки.Колонки.Добавить("ЭлектронныйДокумент");
			ТаблицаДанныхДляБлокировки.Колонки.Добавить("НаправлениеЭД");
			ТаблицаДанныхДляБлокировки.Колонки.Добавить("ВладелецЭД");
			
			Для каждого СтрокаЭД Из ОбъектыДляОбработки Цикл
				НоваяСтрока = ТаблицаДанныхДляБлокировки.Добавить();
				НоваяСтрока.ЭлектронныйДокумент = СтрокаЭД;
				НоваяСтрока.НаправлениеЭД       = Перечисления.НаправленияЭД.Исходящий;
				НоваяСтрока.ВладелецЭД          = СтрокаЭД.Документ;
			КонецЦикла;
			
			ЭлементБлокировки = Блокировка.Добавить("Справочник.СообщенияЭДО");
			ЭлементБлокировки.ИсточникДанных = ТаблицаДанныхДляБлокировки;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "ЭлектронныйДокумент");
			
			ТаблицаЭД.Загрузить(ТаблицаДанныхДляБлокировки);
			
			Если ОбъектыДляОбработки.Количество() = 1 Тогда
				ЭлектронныйДокумент = ОбъектыДляОбработки[0];
				
				ШаблонГиперссылки = НСтр("ru = '%1 № %2 от %3'");
				Если ТипЗнч(ЭлектронныйДокумент.Документ) = Тип("СправочникСсылка.СоглашенияОбИспользованииЭД") Тогда
					СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент,
						"ВидЭД, НомерДокументаОтправителя, ДатаДокументаОтправителя, Организация");
					Если СтруктураРеквизитов.ВидЭД = Перечисления.ВидыЭД.КаталогТоваров Тогда
						ШаблонГиперссылки = НСтр("ru = '%1 %2 от %3'");
						ТекстГиперссылки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонГиперссылки,
							СтруктураРеквизитов.ВидЭД, СтруктураРеквизитов.Организация,
							Формат(СтруктураРеквизитов.ДатаДокументаОтправителя, "ДЛФ=Д"));
					ИначеЕсли СтруктураРеквизитов.ВидЭД = Перечисления.ВидыЭД.ЗапросВыписки Тогда
						ТекстГиперссылки = Строка(ОбъектыДляОбработки[0]);
					Иначе
						ТекстГиперссылки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонГиперссылки,
							СтруктураРеквизитов.ВидЭД, СтруктураРеквизитов.НомерДокументаОтправителя,
							Формат(СтруктураРеквизитов.ДатаДокументаОтправителя, "ДЛФ=Д"));
					КонецЕсли;
				Иначе
					Если ЭлектронныеДокументыСлужебныйВызовСервера.ЭтоСлужебныйДокумент(ЭлектронныйДокумент) Тогда
						
						ВидОперации = НСтр("ru = 'Подписание служебных электронных документов'");
						
						ШаблонГиперссылки = НСтр("ru = '%1'");
						ВидЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйДокумент,
							"ВидЭД");
						ТекстГиперссылки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонГиперссылки, ВидЭД);
					Иначе
						СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент.Документ, "Номер, Дата");
						ТекстГиперссылки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонГиперссылки,
							Строка(ТипЗнч(ЭлектронныйДокумент.Документ)),
							СтруктураРеквизитов.Номер, Формат(СтруктураРеквизитов.Дата, "ДЛФ=Д"));
					КонецЕсли;
				КонецЕсли;
				
				ТекстГиперссылки = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ТекстГиперссылки);
			ИначеЕсли ОбъектыДляОбработки.Количество() > 1 Тогда
				
				ШаблонГиперссылки = НСтр("ru = 'Электронные документы (%1)'");
				ТекстГиперссылки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонГиперссылки,
					ОбъектыДляОбработки.Количество());
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ОбъектыДляОбработки) = Тип("СправочникСсылка.СообщенияЭДО") Тогда
			ЭлектронныйДокумент = ОбъектыДляОбработки;

			ЭлементБлокировки = Блокировка.Добавить("Справочник.СообщенияЭДО");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ЭлектронныйДокумент);
			
			НоваяСтрока = ТаблицаЭД.Добавить();
			НоваяСтрока.ЭлектронныйДокумент = ЭлектронныйДокумент;
			НоваяСтрока.НаправлениеЭД       = Перечисления.НаправленияЭД.Исходящий;
			НоваяСтрока.ВладелецЭД          = ЭлектронныйДокумент.Документ;
			
			ШаблонГиперссылки = НСтр("ru = '%1 № %2 от %3'");
			Если ТипЗнч(ЭлектронныйДокумент.Документ) = Тип("СправочникСсылка.СоглашенияОбИспользованииЭД") Тогда
				СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент,
					"ВидЭД, НомерДокументаОтправителя, ДатаДокументаОтправителя, Организация");
				Если СтруктураРеквизитов.ВидЭД = Перечисления.ВидыЭД.КаталогТоваров Тогда
					ШаблонГиперссылки = НСтр("ru = '%1 %2 от %3'");
					ТекстГиперссылки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонГиперссылки,
						СтруктураРеквизитов.ВидЭД, СтруктураРеквизитов.Организация,
						Формат(СтруктураРеквизитов.ДатаДокументаОтправителя, "ДЛФ=Д"));
				Иначе
					ТекстГиперссылки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонГиперссылки,
						СтруктураРеквизитов.ВидЭД, СтруктураРеквизитов.НомерДокументаОтправителя,
						Формат(СтруктураРеквизитов.ДатаДокументаОтправителя, "ДЛФ=Д"));
				КонецЕсли;
			Иначе
				СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйДокумент.Документ,
					"Номер, Дата");
				ТекстГиперссылки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонГиперссылки,
					Строка(ТипЗнч(ЭлектронныйДокумент.Документ)),
					СтруктураРеквизитов.Номер, Формат(СтруктураРеквизитов.Дата, "ДЛФ=Д"));
			КонецЕсли;
			
			ТекстГиперссылки = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ТекстГиперссылки);
			
		ИначеЕсли ТипЗнч(ОбъектыДляОбработки) = Тип("ДокументСсылка.ПакетЭД") Тогда
			ПакетЭД = ОбъектыДляОбработки;
			
			ЭлементБлокировки = Блокировка.Добавить("Документ.ПакетЭД");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ПакетЭД);
			Блокировка.Заблокировать();
			
			НоваяСтрока = ТаблицаЭД.Добавить();
			НоваяСтрока.ЭлектронныйДокумент = ПакетЭД;
			НоваяСтрока.НаправлениеЭД       = Перечисления.НаправленияЭД.Исходящий;
			НоваяСтрока.ВладелецЭД          = ПакетЭД;
			
			ШаблонГиперссылки = НСтр("ru = '%1 № %2 от %3'");
			СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПакетЭД, "Номер, Дата");
			ТекстГиперссылки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонГиперссылки,
				Строка(ТипЗнч(ПакетЭД)),
				СтруктураРеквизитов.Номер, Формат(СтруктураРеквизитов.Дата, "ДЛФ=Д"));
				
			ТекстГиперссылки = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ТекстГиперссылки);
			
		КонецЕсли;
		
		НадписьОбъектыДляОбработки = ТекстГиперссылки;
		
		Блокировка.Заблокировать();
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	УстановитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры
